<template>
  <TemplatesNewsDetails
    :id="id"
    :title="title"
  >
    <blockquote>
      ～未来を守ろう！再生可能エネルギー～
    </blockquote>
    <p>
      中学校に入学して間もなく、多くの生徒が、教室にエアコンが設置されていることに気付き、話題になった。また、年間行事予定を配付すると、これまでにはなかった秋休み「キッズデイズ」に注目する生徒もいた。これらに共通することを生徒たちに聞くと、昨年度の記録的な猛暑によって、身近に起きた混乱を次々に口にする様子が見られた。近年の異常気象の背景には、「地球温暖化」が関わっていると考える生徒も多くいた。
    </p>
    <p>
      単元前に行ったアンケート調査では、各学級の半数以上の生徒が、環境問題について調べたり、話し合ったりしたことがあると答えた。また、全体の約７割の生徒が、小学校時代に、原子力発電の今後の展開について、討論をしたことがあると分かった。そこで、生徒たちは、人類の生存基盤さえも脅かしかねない、深刻な地球温暖化問題を考える際に、解決しなければならないエネルギー問題に注目することができると考えた。実際に、生徒たちに、地球温暖化の主な原因物質である、二酸化炭素の発生源についての資料を示すと、最大の発生源は、エネルギーの利用であることに気付くことができた。しかしながら、それらに関する知識は乏しく、話し合いに参加できる生徒は、ごく一部に限られた。「自分たちにはあまり関係ない」「まだ遠い未来の話である」と考える生徒も少なからず存在しており、未来を担う社会の一員としての自覚は、足りないように感じた。
    </p>
    <p>
      そこで、第１時では、昨年度の出来事を想起させ、環境問題について知っていることを話し合い、課題について考えた。生徒たちは、温暖化を防ぐために、車を極力使わないようにしたり、節電をしたり、リサイクルをしたりするといった、身近な取り組みを挙げた。そこで、温暖化の原因物質の発生源に関する資料を提示したところ、エネルギー問題にも注目することができた。エネルギー問題にまで視野を広げ、考えることで、未来を担う社会の一員であるという自覚をもつことができた。
    </p>
    <div class="image-container">
      <img src="~/assets/images/KakaoTalk_Image_2022-11-18-02-49-10.jpeg">
      <img src="~/assets/images/KakaoTalk_Photo_2022-11-18-02-51-41.jpeg">
    </div>
  </TemplatesNewsDetails>
</template>

<script setup lang="ts">
const route = useRoute();
const id = route.params.id as string;
const title = '「再生可能エネルギー」の未来について考えよう（岩津中１年生の実践）';
</script>
