<template>
  <div class="news-details">
    <article>
      <h1>
        {{ title }}
      </h1>
      <slot />
    </article>
    <!-- <article>
      <h1>
        「再生可能エネルギー」の未来について考えよう（岩津中１年生の実践）
      </h1>
      <blockquote>
        ～未来を守ろう！再生可能エネルギー～
      </blockquote>
      <p>
        中学校に入学して間もなく、多くの生徒が、教室にエアコンが設置されていることに気付き、話題になった。また、年間行事予定を配付すると、これまでにはなかった秋休み「キッズデイズ」に注目する生徒もいた。これらに共通することを生徒たちに聞くと、昨年度の記録的な猛暑によって、身近に起きた混乱を次々に口にする様子が見られた。近年の異常気象の背景には、「地球温暖化」が関わっていると考える生徒も多くいた。
      </p>
      <p>
        単元前に行ったアンケート調査では、各学級の半数以上の生徒が、環境問題について調べたり、話し合ったりしたことがあると答えた。また、全体の約７割の生徒が、小学校時代に、原子力発電の今後の展開について、討論をしたことがあると分かった。そこで、生徒たちは、人類の生存基盤さえも脅かしかねない、深刻な地球温暖化問題を考える際に、解決しなければならないエネルギー問題に注目することができると考えた。実際に、生徒たちに、地球温暖化の主な原因物質である、二酸化炭素の発生源についての資料を示すと、最大の発生源は、エネルギーの利用であることに気付くことができた。しかしながら、それらに関する知識は乏しく、話し合いに参加できる生徒は、ごく一部に限られた。「自分たちにはあまり関係ない」「まだ遠い未来の話である」と考える生徒も少なからず存在しており、未来を担う社会の一員としての自覚は、足りないように感じた。
      </p>
      <p>
        そこで、第１時では、昨年度の出来事を想起させ、環境問題について知っていることを話し合い、課題について考えた。生徒たちは、温暖化を防ぐために、車を極力使わないようにしたり、節電をしたり、リサイクルをしたりするといった、身近な取り組みを挙げた。そこで、温暖化の原因物質の発生源に関する資料を提示したところ、エネルギー問題にも注目することができた。エネルギー問題にまで視野を広げ、考えることで、未来を担う社会の一員であるという自覚をもつことができた。
      </p>
      <div class="image-container">
        <img src="~/assets/images/KakaoTalk_Image_2022-11-18-02-49-10.jpeg">
        <img src="~/assets/images/KakaoTalk_Photo_2022-11-18-02-51-41.jpeg">
      </div>
    </article> -->
    <!-- <article>
      <h1>
        米作りを通して豊かな心をはぐくむ（梅園小５年生の実践）
      </h1>
      <blockquote>
        米作りを通して豊かな心を育む&nbsp;～米作りプロジェクト～
      </blockquote>
      <p>
        ４月の家庭科の学習で、１年間の学習でどのような学習をするのか見通しを立てた。その時に、２学期に米を炊く授業があることに子どもが気付き、米に対して興味関心を多くの子が示していた。すると、クラスの中のある子が、田植えや脱穀をしたことがあるという経験談を語り始めた。それを聞いた周りの子たちも、自分たちで米を育ててみたいと言うようになった。
      </p>
      <p>
        そこで総合的な学習の時間で一人１つのバケツを用意し、「米作りプロジェクト」と称してバケツ稲作りの実践を行うことにした。その中で、自然について考えたり、米を育てる大変さから食の有難さなどについて感じたりできるようにしたいと考えた。
      </p>
      <p>
        活動のスタートは５月、種もみをプリンカップで発芽させるところから始まった。一人一つずつプリンカップを用意し、毎日こまめに水をかえ、発芽したことに子ども達は喜びを感じた。ある程度大きくなると苗をバケツに移し替えた。バケツの中の田んぼの土は、学区に田んぼがないため、知り合いの方にお願いして土を分けてもらっていた。そこからも、水を切らさないように毎日水の管理に気を付けたり、日々の成長を記録したりしながら育てた。
      </p>
      <p>
        ７月には４０～５０㎝程まで大きく育ち、中干しを行って夏休み中には各家庭に持ち帰り、家で引き続き観察しながら世話をさせた。夏休みが明けると、子どもたちから「花がさいたよ！」と、開花が見られたことに喜びを感じていた。また、支柱を立てて、ネットを張り、スズメ対策をしている工夫も見られた。また、多くの子たちが夏休み中に穂が出始め、２学期に入って２～３週間が経つと、収穫できるまで育っていた。
      </p>
      <p>
        収穫には牛乳パックで脱穀し、すり鉢とすりこぎを用いて手作業で脱穀した。その後、玄米の状態になったものを家に持ち帰り、各家庭で食べた。
      </p>
      <p>
        子どもたちは、自ら米作りを経験し、農家の人の苦労や、米の有難さについて考えることができた。また、初めてする経験から、自然と触れ合い、自分で育てた米に愛着を持ち、おいしく頂くことができたことに喜びを感じることができた。
      </p>
      <div class="image-container">
        <img src="~/assets/images/KakaoTalk_Photo_2022-11-18-02-52-17.jpeg">
        <img src="~/assets/images/KakaoTalk_Photo_2022-11-18-02-52-24.jpeg">
      </div>
    </article> -->
  </div>
</template>

<script setup lang="ts">
defineProps<{
  id?: string;
  title: string;
}>();
</script>

<style lang="scss">
.news-details {
  @apply flex items-center flex-col w-full min-h-screen mb-20;

  & > article {
    @apply my-12;

    width: 1000px;

    & > h1 {
      @apply text-primary text-2xl font-bold my-5;
    }

    & > blockquote {
      @apply w-full p-3 bg-gray-100 border-2 my-5;
    }

    & > p {
      @apply my-5;
    }

    & > .image-container {
      @apply flex;

      & > img {
        @apply mr-3;
      }
    }
  }
}
</style>
